Revit 2026 API

# InitialFluxIntensity(InitialFluxIntensity) Constructor

---

Creates a copy of the given initial flux intensity object

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public InitialFluxIntensity(
	InitialFluxIntensity other
)
```
```vb
Public Sub New (
	other As InitialFluxIntensity
)
```
```cpp
public:
InitialFluxIntensity(
	InitialFluxIntensity^ other
)
```
```fsharp
new :
        other : InitialFluxIntensity -> InitialFluxIntensity
```

#### Parameters

other InitialFluxIntensity

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

InitialFluxIntensity Class

InitialFluxIntensity Overload

Autodesk.Revit.DB.Lighting Namespace